<?php

return [

    // 模板参数替换
    'view_replace_str'       => array(
        '__CSS__'    => '/static/admin/css',
        '__JS__'     => '/static/admin/js',
        '__IMG__' => '/static/admin/images',
    ),

    // 管理员/用户状态
    'user_status' => [
        '1' => '正常',
        '2' => '禁用'
    ],
    // 角色状态
    'role_status' => [
        '1' => '启用',
        '2' => '禁用'
    ],

    //商品状态
    'goods_status' => [
        '1' => '销售中',
        '2' => '已下架'
    ],
    //订单状态
    'order_status' => [
        '1' => '待付款',
        '2' => '待发货',
        '3' => '待收货',
        '4' => '已完成',
        '5' => '取消订单',
        '6' => '删除订单',
        '7' => '结束',
        '8' => '抢购完成',
        '9' => '抢购失败'
    ],
    //支付类型
    'payment' => [
        '0' => '支付宝',
        '1' => '微信',
        '3' => '积分',
        '2' => '余额'
    ],
    //订单类型
    'order_type' => [
        '1' => '抢购',
        '2' => '窥探',
        '3' => '抢购成功',
        '0' => '大礼包'
    ],
];
